Update project1_can_gateway_interview.md
